In [1]:
import pandas as pd
import sqlite3

def sql_query(query):
    c = cur.execute(query)
    df = pd.DataFrame(c.fetchall(), 
                      columns=[description[0] for description in c.description])
    return df

### State of the UNION

In [2]:
conn = sqlite3.connect('leaders.sqlite')
cur = conn.cursor()

In [3]:
sql_query('''SELECT prime_minister as leader, country
FROM prime_ministers
UNION
SELECT monarch, country
FROM monarchs
ORDER BY country;''')

                     leader    country
0          Malcolm Turnbull  Australia
1          Hassanal Bolkiah     Brunei
2             Sherif Ismail      Egypt
3        Jack Guy Lafontant      Haiti
4             Narendra Modi      India
5              Erna Solberg     Norway
6                  Harald V     Norway
7   Qaboos bin Said al Said       Oman
8             Antonio Costa   Portugal
9                 Felipe VI      Spain
10            Mariano Rajoy      Spain
11         Nguyen Xuan Phuc    Vietnam

In [4]:
sql_query('''SELECT prime_minister as leader, country
FROM prime_ministers
UNION ALL
SELECT monarch, country
FROM monarchs
ORDER BY country;''')

                     leader    country
0          Malcolm Turnbull  Australia
1          Hassanal Bolkiah     Brunei
2          Hassanal Bolkiah     Brunei
3             Sherif Ismail      Egypt
4        Jack Guy Lafontant      Haiti
5             Narendra Modi      India
6              Erna Solberg     Norway
7                  Harald V     Norway
8   Qaboos bin Said al Said       Oman
9   Qaboos bin Said al Said       Oman
10            Antonio Costa   Portugal
11            Mariano Rajoy      Spain
12                Felipe VI      Spain
13         Nguyen Xuan Phuc    Vietnam

In [5]:
conn.close()

In [6]:
conn = sqlite3.connect('countries.sqlite')
cur = conn.cursor()

In [7]:
sql_query('''-- Select fields from 2010 table
SELECT *
  -- From 2010 table
  FROM economies2010
	-- Set theory clause
	UNION
-- Select fields from 2015 table
SELECT * 
  -- From 2015 table
  FROM economies2015
-- Order by code and year
ORDER BY code, year;''').head(3)

  code  year         income_group  gross_savings
0  AFG  2010           Low income         37.133
1  AFG  2015           Low income         21.466
2  AGO  2010  Upper middle income         23.534

In [8]:
len(sql_query('''-- Select field
SELECT country_code
  -- From cities
  FROM cities 
	-- Set theory clause
	UNION
-- Select field
SELECT code 
  -- From currencies
  FROM currencies 
-- Order by country_code
ORDER BY country_code;'''))

205

In [9]:
len(sql_query('''-- Select fields
SELECT code, year
  -- From economies
  FROM economies
	-- Set theory clause
	UNION ALL 
-- Select fields
SELECT country_code, year  
  -- From populations
  FROM populations
-- Order by code, year
ORDER BY code, year;'''))

814

In [10]:
conn.close()

In [11]:
conn = sqlite3.connect('leaders.sqlite')
cur = conn.cursor()

In [12]:
sql_query('''SELECT country
FROM prime_ministers
INTERSECT
SELECT country
FROM presidents;''')

    country
0     Egypt
1     Haiti
2  Portugal
3   Vietnam

In [13]:
sql_query('''SELECT country, prime_minister AS leader
FROM prime_ministers
INTERSECT
SELECT country, president
FROM presidents;''')

Empty DataFrame
Columns: [country, leader]
Index: []

In [14]:
conn.close()

In [15]:
conn = sqlite3.connect('countries.sqlite')
cur = conn.cursor()

In [16]:
len(sql_query('''-- Select fields
SELECT code, year 
  -- From economies
  FROM economies
	-- Set theory clause
	INTERSECT
-- Select fields
SELECT country_code, year 
  -- From populations
FROM populations
-- Order by code and year
ORDER BY code, year;'''))

380

In [17]:
sql_query('''-- Select fields
SELECT country_name 
  -- From countries
  FROM countries 
	-- Set theory clause
	INTERSECT
-- Select fields
SELECT name 
  -- From cities
  FROM cities;''')

  country_name
0    Hong Kong
1    Singapore

In [18]:
conn.close()

In [19]:
conn = sqlite3.connect('leaders.sqlite')
cur = conn.cursor()

In [20]:
sql_query('''SELECT monarch, country
FROM monarchs
EXCEPT
SELECT prime_minister, country
FROM prime_ministers''')

     monarch country
0  Felipe VI   Spain
1   Harald V  Norway

In [21]:
conn.close()